GopalSaraf/Practicals/PSDL/include/proc/pic18f26j11.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F26J11_INC_
#define _PIC18F26J11_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F26J11
 */

/*
 * Device Registers
 */

// Register: RPOR0
#define RPOR0 RPOR0
RPOR0                                    equ 0EC6h

// Register: RPOR1
#define RPOR1 RPOR1
RPOR1                                    equ 0EC7h

// Register: RPOR2
#define RPOR2 RPOR2
RPOR2                                    equ 0EC8h

// Register: RPOR3
#define RPOR3 RPOR3
RPOR3                                    equ 0EC9h

// Register: RPOR4
#define RPOR4 RPOR4
RPOR4                                    equ 0ECAh

// Register: RPOR5
#define RPOR5 RPOR5
RPOR5                                    equ 0ECBh

// Register: RPOR6
#define RPOR6 RPOR6
RPOR6                                    equ 0ECCh

// Register: RPOR7
#define RPOR7 RPOR7
RPOR7                                    equ 0ECDh

// Register: RPOR8
#define RPOR8 RPOR8
RPOR8                                    equ 0ECEh

// Register: RPOR9
#define RPOR9 RPOR9
RPOR9                                    equ 0ECFh

// Register: RPOR10
#define RPOR10 RPOR10
RPOR10                                   equ 0ED0h

// Register: RPOR11
#define RPOR11 RPOR11
RPOR11                                   equ 0ED1h

// Register: RPOR12
#define RPOR12 RPOR12
RPOR12                                   equ 0ED2h

// Register: RPOR13
#define RPOR13 RPOR13
RPOR13                                   equ 0ED3h

// Register: RPOR14
#define RPOR14 RPOR14
RPOR14                                   equ 0ED4h

// Register: RPOR15
#define RPOR15 RPOR15
RPOR15                                   equ 0ED5h

// Register: RPOR16
#define RPOR16 RPOR16
RPOR16                                   equ 0ED6h

// Register: RPOR17
#define RPOR17 RPOR17
RPOR17                                   equ 0ED7h

// Register: RPOR18
#define RPOR18 RPOR18
RPOR18                                   equ 0ED8h

// Register: RPINR1
#define RPINR1 RPINR1
RPINR1                                   equ 0EE7h

// Register: RPINR2
#define RPINR2 RPINR2
RPINR2                                   equ 0EE8h

// Register: RPINR3
#define RPINR3 RPINR3
RPINR3                                   equ 0EE9h

// Register: RPINR4
#define RPINR4 RPINR4
RPINR4                                   equ 0EEAh

// Register: RPINR6
#define RPINR6 RPINR6
RPINR6                                   equ 0EECh

// Register: RPINR7
#define RPINR7 RPINR7
RPINR7                                   equ 0EEDh

// Register: RPINR8
#define RPINR8 RPINR8
RPINR8                                   equ 0EEEh

// Register: RPINR12
#define RPINR12 RPINR12
RPINR12                                  equ 0EF2h

// Register: RPINR13
#define RPINR13 RPINR13
RPINR13                                  equ 0EF3h

// Register: RPINR16
#define RPINR16 RPINR16
RPINR16                                  equ 0EF6h

// Register: RPINR17
#define RPINR17 RPINR17
RPINR17                                  equ 0EF7h

// Register: RPINR21
#define RPINR21 RPINR21
RPINR21                                  equ 0EFBh

// Register: RPINR22
#define RPINR22 RPINR22
RPINR22                                  equ 0EFCh

// Register: RPINR23
#define RPINR23 RPINR23
RPINR23                                  equ 0EFDh

// Register: RPINR24
#define RPINR24 RPINR24
RPINR24                                  equ 0EFEh

// Register: PPSCON
#define PPSCON PPSCON
PPSCON                                   equ 0EFFh
// bitfield definitions
PPSCON_IOLOCK_POSN                       equ 0000h
PPSCON_IOLOCK_POSITION                   equ 0000h
PPSCON_IOLOCK_SIZE                       equ 0001h
PPSCON_IOLOCK_LENGTH                     equ 0001h
PPSCON_IOLOCK_MASK                       equ 0001h

// Register: PADCFG1
#define PADCFG1 PADCFG1
PADCFG1                                  equ 0F3Ch
// bitfield definitions
PADCFG1_PMPTTL_POSN                      equ 0000h
PADCFG1_PMPTTL_POSITION                  equ 0000h
PADCFG1_PMPTTL_SIZE                      equ 0001h
PADCFG1_PMPTTL_LENGTH                    equ 0001h
PADCFG1_PMPTTL_MASK                      equ 0001h
PADCFG1_RTSECSEL0_POSN                   equ 0001h
PADCFG1_RTSECSEL0_POSITION               equ 0001h
PADCFG1_RTSECSEL0_SIZE                   equ 0001h
PADCFG1_RTSECSEL0_LENGTH                 equ 0001h
PADCFG1_RTSECSEL0_MASK                   equ 0002h
PADCFG1_RTSECSEL1_POSN                   equ 0002h
PADCFG1_RTSECSEL1_POSITION               equ 0002h
PADCFG1_RTSECSEL1_SIZE                   equ 0001h
PADCFG1_RTSECSEL1_LENGTH                 equ 0001h
PADCFG1_RTSECSEL1_MASK                   equ 0004h

// Register: REFOCON
#define REFOCON REFOCON
REFOCON                                  equ 0F3Dh
// bitfield definitions
REFOCON_RODIV_POSN                       equ 0000h
REFOCON_RODIV_POSITION                   equ 0000h
REFOCON_RODIV_SIZE                       equ 0004h
REFOCON_RODIV_LENGTH                     equ 0004h
REFOCON_RODIV_MASK                       equ 000Fh
REFOCON_ROSEL_POSN                       equ 0004h
REFOCON_ROSEL_POSITION                   equ 0004h
REFOCON_ROSEL_SIZE                       equ 0001h
REFOCON_ROSEL_LENGTH                     equ 0001h
REFOCON_ROSEL_MASK                       equ 0010h
REFOCON_ROSSLP_POSN                      equ 0005h
REFOCON_ROSSLP_POSITION                  equ 0005h
REFOCON_ROSSLP_SIZE                      equ 0001h
REFOCON_ROSSLP_LENGTH                    equ 0001h
REFOCON_ROSSLP_MASK                      equ 0020h
REFOCON_ROON_POSN                        equ 0007h
REFOCON_ROON_POSITION                    equ 0007h
REFOCON_ROON_SIZE                        equ 0001h
REFOCON_ROON_LENGTH                      equ 0001h
REFOCON_ROON_MASK                        equ 0080h
REFOCON_RODIV0_POSN                      equ 0000h
REFOCON_RODIV0_POSITION                  equ 0000h
REFOCON_RODIV0_SIZE                      equ 0001h
REFOCON_RODIV0_LENGTH                    equ 0001h
REFOCON_RODIV0_MASK                      equ 0001h
REFOCON_RODIV1_POSN                      equ 0001h
REFOCON_RODIV1_POSITION                  equ 0001h
REFOCON_RODIV1_SIZE                      equ 0001h
REFOCON_RODIV1_LENGTH                    equ 0001h
REFOCON_RODIV1_MASK                      equ 0002h
REFOCON_RODIV2_POSN                      equ 0002h
REFOCON_RODIV2_POSITION                  equ 0002h
REFOCON_RODIV2_SIZE                      equ 0001h
REFOCON_RODIV2_LENGTH                    equ 0001h
REFOCON_RODIV2_MASK                      equ 0004h
REFOCON_RODIV3_POSN                      equ 0003h
REFOCON_RODIV3_POSITION                  equ 0003h
REFOCON_RODIV3_SIZE                      equ 0001h
REFOCON_RODIV3_LENGTH                    equ 0001h
REFOCON_RODIV3_MASK                      equ 0008h

// Register: RTCCAL
#define RTCCAL RTCCAL
RTCCAL                                   equ 0F3Eh
// bitfield definitions
RTCCAL_CAL_POSN                          equ 0000h
RTCCAL_CAL_POSITION                      equ 0000h
RTCCAL_CAL_SIZE                          equ 0008h
RTCCAL_CAL_LENGTH                        equ 0008h
RTCCAL_CAL_MASK                          equ 00FFh
RTCCAL_CAL0_POSN                         equ 0000h
RTCCAL_CAL0_POSITION                     equ 0000h
RTCCAL_CAL0_SIZE                         equ 0001h
RTCCAL_CAL0_LENGTH                       equ 0001h
RTCCAL_CAL0_MASK                         equ 0001h
RTCCAL_CAL1_POSN                         equ 0001h
RTCCAL_CAL1_POSITION                     equ 0001h
RTCCAL_CAL1_SIZE                         equ 0001h
RTCCAL_CAL1_LENGTH                       equ 0001h
RTCCAL_CAL1_MASK                         equ 0002h
RTCCAL_CAL2_POSN                         equ 0002h
RTCCAL_CAL2_POSITION                     equ 0002h
RTCCAL_CAL2_SIZE                         equ 0001h
RTCCAL_CAL2_LENGTH                       equ 0001h
RTCCAL_CAL2_MASK                         equ 0004h
RTCCAL_CAL3_POSN                         equ 0003h
RTCCAL_CAL3_POSITION                     equ 0003h
RTCCAL_CAL3_SIZE                         equ 0001h
RTCCAL_CAL3_LENGTH                       equ 0001h
RTCCAL_CAL3_MASK                         equ 0008h
RTCCAL_CAL4_POSN                         equ 0004h
RTCCAL_CAL4_POSITION                     equ 0004h
RTCCAL_CAL4_SIZE                         equ 0001h
RTCCAL_CAL4_LENGTH                       equ 0001h
RTCCAL_CAL4_MASK                         equ 0010h
RTCCAL_CAL5_POSN                         equ 0005h
RTCCAL_CAL5_POSITION                     equ 0005h
RTCCAL_CAL5_SIZE                         equ 0001h
RTCCAL_CAL5_LENGTH                       equ 0001h
RTCCAL_CAL5_MASK                         equ 0020h
RTCCAL_CAL6_POSN                         equ 0006h
RTCCAL_CAL6_POSITION                     equ 0006h
RTCCAL_CAL6_SIZE                         equ 0001h
RTCCAL_CAL6_LENGTH                       equ 0001h
RTCCAL_CAL6_MASK                         equ 0040h
RTCCAL_CAL7_POSN                         equ 0007h
RTCCAL_CAL7_POSITION                     equ 0007h
RTCCAL_CAL7_SIZE                         equ 0001h
RTCCAL_CAL7_LENGTH                       equ 0001h
RTCCAL_CAL7_MASK                         equ 0080h

// Register: RTCCFG
#define RTCCFG RTCCFG
RTCCFG                                   equ 0F3Fh
// bitfield definitions
RTCCFG_RTCPTR0_POSN                      equ 0000h
RTCCFG_RTCPTR0_POSITION                  equ 0000h
RTCCFG_RTCPTR0_SIZE                      equ 0001h
RTCCFG_RTCPTR0_LENGTH                    equ 0001h
RTCCFG_RTCPTR0_MASK                      equ 0001h
RTCCFG_RTCPTR1_POSN                      equ 0001h
RTCCFG_RTCPTR1_POSITION                  equ 0001h
RTCCFG_RTCPTR1_SIZE                      equ 0001h
RTCCFG_RTCPTR1_LENGTH                    equ 0001h
RTCCFG_RTCPTR1_MASK                      equ 0002h
RTCCFG_RTCOE_POSN                        equ 0002h
RTCCFG_RTCOE_POSITION                    equ 0002h
RTCCFG_RTCOE_SIZE                        equ 0001h
RTCCFG_RTCOE_LENGTH                      equ 0001h
RTCCFG_RTCOE_MASK                        equ 0004h
RTCCFG_HALFSEC_POSN                      equ 0003h
RTCCFG_HALFSEC_POSITION                  equ 0003h
RTCCFG_HALFSEC_SIZE                      equ 0001h
RTCCFG_HALFSEC_LENGTH                    equ 0001h
RTCCFG_HALFSEC_MASK                      equ 0008h
RTCCFG_RTCSYNC_POSN                      equ 0004h
RTCCFG_RTCSYNC_POSITION                  equ 0004h
RTCCFG_RTCSYNC_SIZE                      equ 0001h
RTCCFG_RTCSYNC_LENGTH                    equ 0001h
RTCCFG_RTCSYNC_MASK                      equ 0010h
RTCCFG_RTCWREN_POSN                      equ 0005h
RTCCFG_RTCWREN_POSITION                  equ 0005h
RTCCFG_RTCWREN_SIZE                      equ 0001h
RTCCFG_RTCWREN_LENGTH                    equ 0001h
RTCCFG_RTCWREN_MASK                      equ 0020h
RTCCFG_RTCEN_POSN                        equ 0007h
RTCCFG_RTCEN_POSITION                    equ 0007h
RTCCFG_RTCEN_SIZE                        equ 0001h
RTCCFG_RTCEN_LENGTH                      equ 0001h
RTCCFG_RTCEN_MASK                        equ 0080h

// Register: ODCON3
#define ODCON3 ODCON3
ODCON3                                   equ 0F40h
// bitfield definitions
ODCON3_SPI1OD_POSN                       equ 0000h
ODCON3_SPI1OD_POSITION                   equ 0000h
ODCON3_SPI1OD_SIZE                       equ 0001h
ODCON3_SPI1OD_LENGTH                     equ 0001h
ODCON3_SPI1OD_MASK                       equ 0001h
ODCON3_SPI2OD_POSN                       equ 0001h
ODCON3_SPI2OD_POSITION                   equ 0001h
ODCON3_SPI2OD_SIZE                       equ 0001h
ODCON3_SPI2OD_LENGTH                     equ 0001h
ODCON3_SPI2OD_MASK                       equ 0002h

// Register: ODCON2
#define ODCON2 ODCON2
ODCON2                                   equ 0F41h
// bitfield definitions
ODCON2_U1OD_POSN                         equ 0000h
ODCON2_U1OD_POSITION                     equ 0000h
ODCON2_U1OD_SIZE                         equ 0001h
ODCON2_U1OD_LENGTH                       equ 0001h
ODCON2_U1OD_MASK                         equ 0001h
ODCON2_U2OD_POSN                         equ 0001h
ODCON2_U2OD_POSITION                     equ 0001h
ODCON2_U2OD_SIZE                         equ 0001h
ODCON2_U2OD_LENGTH                       equ 0001h
ODCON2_U2OD_MASK                         equ 0002h

// Register: ODCON1
#define ODCON1 ODCON1
ODCON1                                   equ 0F42h
// bitfield definitions
ODCON1_ECCP1OD_POSN                      equ 0000h
ODCON1_ECCP1OD_POSITION                  equ 0000h
ODCON1_ECCP1OD_SIZE                      equ 0001h
ODCON1_ECCP1OD_LENGTH                    equ 0001h
ODCON1_ECCP1OD_MASK                      equ 0001h
ODCON1_ECCP2OD_POSN                      equ 0001h
ODCON1_ECCP2OD_POSITION                  equ 0001h
ODCON1_ECCP2OD_SIZE                      equ 0001h
ODCON1_ECCP2OD_LENGTH                    equ 0001h
ODCON1_ECCP2OD_MASK                      equ 0002h

